Revit 2024 API
BuiltInFailures.DimensionFailures.NoConstraintsToLinks Property
 Constraints may not be created to linked instances using Shared Locations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoConstraintsToLinks { get; }
Visual Basic
Public Shared ReadOnly Property NoConstraintsToLinks As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoConstraintsToLinks {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace